<?php
//$x = 100;
//$y = -200;
//if ($x > 0 && $y > 0) {
//    echo "В первую четверть";
//} elseif ($x < 0 && $y > 0) {
//    echo "Во вторую четверть";
//} elseif ($x < 0 && $y < 0) {
//    echo "В третью четверть";
//} elseif ($x > 0 && $y < 0) {
//    echo "В четвертую четверть";
//} else {
//    echo "ошибка 0";
//}

//$x = 1;
//$y = 2;
//if ($x % $y === 0) {
//    echo "делится без остатка";
//} else {
//    echo "делится с остатком";
//}
//
$a = 1;
$b = 2;
$c = 3;
$x = 4;

echo  ($x^2+$b*$x+$c );
